app/views/home/index.html.erb

  <ul>
    <%Section.all.each do |name|%>
---
SELECT "sections".* FROM "sections"