app/controllers/home_controller.rb

SELECT "sections".* FROM "sections"
---
  def index
    @section = Section.all