app/controllers/sections_controller.rb

  def show
    @items = MenuItem.where(menu_section_id: params[:id])
    @section = Section.find(params[:id])
---
SELECT  "sections".* FROM "sections" WHERE "sections"."id" = $1 LIMIT 1  [["id", 5]]

  def create
    @section = Section.new
    @section.name = params[:section_name]
    @section.description = params[:section_description]
    if @section.save
      redirect_to "/sections"
    else
      @sections = Section.all
---
INSERT INTO "sections" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Oysters"], ["description", ""], ["created_at", "2015-11-11 19:57:21.412777"], ["updated_at", "2015-11-11 19:57:21.412777"]]
SELECT "sections".* FROM "sections"